<a href="https://colab.research.google.com/github/masum-auch/AI-Engineer/blob/main/Numpy%20%26%20Pandas/Pandas/03_pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Pandas Series learn | part 2

### series read_csv

In [17]:
#import pandas
import pandas as pd

In [21]:
# with one col
subs = pd.read_csv('/content/subs.csv').squeeze()
subs

0       48
1       57
2       40
3       43
4       44
      ...
360    231
361    226
362    155
363    144
364    172
Name: Subscribers gained, Length: 365, dtype: int64

In [22]:
#with two columns
vk= pd.read_csv('/content/kohli_ipl.csv', index_col= 'match_no').squeeze()

In [24]:
type(vk)

pandas.core.series.Series

In [25]:
vk

match_no
1       1
2      23
3      13
4      12
5       1
       ..
211     0
212    20
213    73
214    25
215     7
Name: runs, Length: 215, dtype: int64

In [27]:
#movies
movie= pd.read_csv('/content/bollywood.csv', index_col= 'movie').squeeze()

In [29]:
type(movie)

pandas.core.series.Series

## Series methods

In [30]:
#head
subs.head()

0    48
1    57
2    40
3    43
4    44
Name: Subscribers gained, dtype: int64

In [31]:
#sample
subs.sample(20)

323    196
234    233
173    114
255    159
26      46
3       43
206    113
269    138
281    245
191    150
280    295
309    150
277    276
308    152
77     123
127     85
196    103
263    184
103     67
76     132
Name: Subscribers gained, dtype: int64

In [32]:
#describe
subs.describe()

count    365.000000
mean     135.643836
std       62.675023
min       33.000000
25%       88.000000
50%      123.000000
75%      177.000000
max      396.000000
Name: Subscribers gained, dtype: float64

In [33]:
#missing value check method
subs.isna().sum()

np.int64(0)

In [35]:
#tail

vk.tail()

match_no
211     0
212    20
213    73
214    25
215     7
Name: runs, dtype: int64

In [38]:
#sample
movie.sample(5)

movie
My Brother…Nikhil                    Sanjay Suri
Veer-Zaara                        Shah Rukh Khan
Umrao Jaan (2006 film)    Aishwarya Rai Bachchan
Anna (2016 film)              Shashank Udapurkar
High Jack (film)                     Sumeet Vyas
Name: lead, dtype: object

In [41]:
# value_counts -> movies
movie.value_counts()

lead
Akshay Kumar         48
Amitabh Bachchan     45
Ajay Devgn           38
Salman Khan          31
Sanjay Dutt          26
                     ..
Seema Azmi            1
Akanksha Puri         1
Charanpreet Insan     1
Jaideep Ahlawat       1
Monali Thakur         1
Name: count, Length: 566, dtype: int64

In [48]:
# sort_values -> inplace
vk.sort_values(ascending=False).head(1).values[0]

np.int64(113)

In [50]:
# sort_index -> inplace -> movies
movie.sort_index(ascending=False,inplace=True)

In [51]:
movie

movie
Zor Lagaa Ke...Haiya!            Meghan Jadhav
Zokkomon                       Darsheel Safary
Zindagi Tere Naam           Mithun Chakraborty
Zindagi Na Milegi Dobara        Hrithik Roshan
Zindagi 50-50                      Veena Malik
                                   ...
2 States (2014 film)              Arjun Kapoor
1971 (2007 film)                Manoj Bajpayee
1920: The Evil Returns             Vicky Ahuja
1920: London                     Sharman Joshi
1920 (film)                   Rajniesh Duggall
Name: lead, Length: 1500, dtype: object

In [52]:
movie.head(5)

movie
Zor Lagaa Ke...Haiya!            Meghan Jadhav
Zokkomon                       Darsheel Safary
Zindagi Tere Naam           Mithun Chakraborty
Zindagi Na Milegi Dobara        Hrithik Roshan
Zindagi 50-50                      Veena Malik
Name: lead, dtype: object